Repository: Anard/upgrade-gentoo
Catalog: locale/*.po
Languages: fr

source: Invalid call to function ${FUNCNAME[0]}
fr: Appel invalide à la fonction ${FUNCNAME[0]}

source: Invalid parameter $1 for function ${FUNCNAME[0]}
fr: Paramètre $1 invalide pour la fonction ${FUNCNAME[0]}

source: Invalid parameter for function ${FUNCNAME[0]}
fr: Paramètre invalide pour la focntion ${FUNCNAME[0]}

source: An error occurred while setting parameters
fr: Un erreur est survenue lors de la saisie des paramètres

source: Cancelled ${func}
fr: Fonction ${func} annulée

source: Syncing repositories
fr: Mise à jour des dépôts

source: An error occurred while syncing, please check logs
fr: Un erreur est survenue lors de la mise à jour des dépôts, référez-vous aux logs

source: Preparing for cleaning
fr: Préparation au nettoyage

source: An error occurred while checking for obsolete packages, please check logs
fr: Un erreur est survenue lors de la recherche de paquets obsolètes, référez-vous aux logs

source: Cleaning your system
fr: Nettoyage du système

source: An error occurred while cleaning system, please check logs
fr: Un erreur est survenue lors du nettoyage du système, référez-vous aux logs

source: Checking for upgrades
fr: Recherche de mises à jour

source: Checking for ${UP} upgrade
fr: Recherche de mises à jour pour ${UP}

source: An error occurred while checking dependencies, please check logs
fr: Une erreur est apparuee lors du calcul des dépendences, référez-vous aux logs

source: Upgrading your system
fr: Mise à jour du système

source: Upgrading ${UP}
fr: Mise à jour de ${UP}

source: Upgrading ${pack^}
fr: Mise à jour de ${pack^}

source: An error occurred while upgrading system, please check logs
fr: Une erreur est survenue lors de la mise à jour du système, référez-vous aux logs

source: Updating eix database
fr: Mise à jour de la base de eix

source: Checking for obsolete packages
fr: Recherche de paquets obsolètes

source: Calculating dependencies
fr: Calcul des dépendences

source: Calculating upgrade
fr: Calcul de la mise à jour

source: Configuration file needs update
fr: Un fichier de configuration demande une mise à jour

source: Skip
fr: Passer

source: Continue
fr: Continuer

source: Messages for ${package}
fr: Messages de ${package}

source: Error
fr: Erreur

source: Some configuration is necessary to proceed
fr: Une nouvelle configuration est requise

source: Uncheck packages you want to exclude.
fr: Décochez les paquets que vous voulez exclure

source: Unmerge
fr: Supprimer

source: Package
fr: Paquet

source: Selected
fr: Sélectionné

source: Protected
fr: Protégé

source: Omitted
fr: Omis

source: One package won't be installed :
fr: Un paquet ne sera pas installé

source: ${#nomerge_action[@]} packages won't be installed :
fr: ${#nomerge_action[@]} paquets ne seront pas installés

source: Estimating merge time
fr: Estimation du temps de compilation

source: Unknown merge time for ${package[$i]}
fr: Temps de compilation inconnu pour ${package[$i]}

source: Average merge time for ${package[$i]} is ${time_h[$i]}
fr: Temps moyen de compilation pour ${package[$i]} : ${time_h[$i]}

source: Estimated merge time is
fr: Temps de compilation estimé :

source: Merge
fr: Installer

source: Current
fr: Acuelle

source: Time
fr: Temps

source: ${UP} needs update, it's highly recommended to do it first.\n
fr: ${UP} nécessite une mise à jour. Il est fortement recommandé de commencer par celle-ci

source: One package should be merged
fr: Un paquet sera compilé

source: ${number} packages should be merged
fr: ${number} paquets seront compilés

source: One package should be unmerged
fr: Un paquet sera supprimé

source: ${number} packages should be unmerged
fr: ${number} paquets seront supprimés

source: ${bold}Script for upgrading Gentoo${normal}Usage : ${Blue}upgrade${normal} [${Green}OPTIONS${normal}] [${Green}@SET${normal}]${Green}OPTIONS${normal} : ${bold}-h|--help${normal} Print this help and exit ${bold}-V|--version${normal} Print this script's current version and exit ${bold}-q|--quiet${normal} Run quietly ${bold}-v|--verbose${normal} Run verbosely ${bold}-x${normal} Run graphically${Green}SET${normal} : Set to upgrade, if not set ${green}@world${nocolor} will be used
fr: ${bold}Script pour mettre à jour Gentoo${normal}Utilisation : ${Blue}upgrade${normal} [${Green}OPTIONS${normal}] [${Green}@SET${normal}]${Green}OPTIONS${normal} : ${bold}-h|--help${normal} Afficher cette aide et sortir ${bold}-V|--version${normal} Afficher la version courante de ce script et sortir ${bold}-q|--quiet${normal} Mode silencieux ${bold}-v|--verbose${normal} Mode bavard ${bold}-x${normal} Mode graphique${Green}SET${normal} : Set à mettre à jour, si non précisé, ${green}@world${nocolor} sera utilisé

source: ${Orange}${script_name^}${normal} script for portage based system, version ${orange}${version}${nocolor}
fr: Script ${Orange}${script_name^}${normal} pour les systèmes basés sur portage, version ${orange}${version}${nocolor}

source: Aborted
fr: Annulé

source: ${red}Unknown parameter ${1}${nocolor}, exiting...
fr: ${red}Paramètre ${1} inconnu${nocolor}, abandon...

source: Checking repositories
fr: Contrôle des dépôts

source: Last sync for ${repos[$i]##*/} is
fr: Dernière synchronisation de ${repos[$i]##*/} :

source: Time error
fr: Heure erronnée

source: Sync date for ${repos[$i]##*/} is newer than now
fr: Le dépôt ${repos[$i]##*/} a déjà été synchronisé à une date ultérieure

source: , please correct your local time
fr: , merci de corriger l'heure de votre appareil

source: Exiting...
fr: Abandon...

source: Unknown last sync for ${repos[$i]##*/}
fr: Dernière synchronisation de ${repos[$i]##*/} inconnue

source: Your last sync is newer than 1 day
fr: Votre dernière synchronisation date de moins de 24 heures

source: Do you want to sync again ?
fr: Voulez-vous forcer la synchronisation ?

source: y
fr: o

source: Unknown answer ${ans}
fr: Réponse ${ans} inconnue

source: Last sync newer than 24h
fr: Dernière synchronisation datant de moins de 24 heures

source: forcing sync
fr: synchonisation forcée

source: skipping sync
fr: synchronisation rejetée

source: ${#index[@]} news need reading
fr: ${#index[@]} news non-lues

source: Keep checked those you want to read now
fr: Cochez celles que vous voulez lire maintenant

source: Partial upgrade is done
fr: Mise à jour partielle terminée

source: Upgrade
fr: Mise à jour

source: An error occurred on compilation time
fr: Un ereur est survenue lors de la compilation

source: please check logs for more information
fr: Référez-vous aux logs pour plus d'informations

source: Your system is now up to date
fr: Votre système est à jour

source: Your system was already up to date
fr: Votre système était déjà à jour
